In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [13]:
titanic = sns.load_dataset('titanic')
df = titanic  #.loc[:, ['age', 'sex', 'class', 'fare', 'survived', 'deck']]

In [15]:
df.age.mean()

df['deck'].value_counts(dropna=False)   # 범주형

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [22]:
## nan

# print(df.head().isnull())

df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [25]:
df_thres_na = df.dropna(axis= 1, thresh= 500)
print(df_thres_na.head())
print(df_thres_na.shape)

df_age = df.dropna(subset=['age'], how= 'any', axis= 0)
print(df_age.shape)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class
0         0       3    male  22.0      1      0   7.2500        S  Third  \
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male  embark_town alive  alone
0    man        True  Southampton    no  False
1  woman       False    Cherbourg   yes  False
2  woman       False  Southampton   yes   True
3  woman       False  Southampton   yes  False
4    man        True  Southampton    no   True
(891, 14)
(714, 15)

In [30]:
rep_value = df.age.mean()
df.age.fillna(rep_value, inplace= True)

df.age.isnull().sum()
# df.head()

0

In [39]:
df.deck.fillna(method= 'ffill', inplace= True)
df.deck

0      NaN
1        C
2        C
3        C
4        C
      ...
886      C
887      B
888      B
889      C
890      C
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [43]:
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})

print(df)

df_dup = df.duplicated()
print(df_dup)

df['c1'].duplicated()

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
0    False
1     True
2    False
3    False
4    False
dtype: bool

0    False
1     True
2    False
3     True
4     True
Name: c1, dtype: bool

In [44]:
df2 = df.drop_duplicates()

df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2